Revit 2027 API
BuiltInFailures.DPartFailures.PartPhaseParametersConflictWithOriginal Property
 The creation and demolition phases of a part must lie between the corresponding phases of the original.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PartPhaseParametersConflictWithOriginal { get; }
Public Shared ReadOnly Property PartPhaseParametersConflictWithOriginal As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PartPhaseParametersConflictWithOriginal {
	FailureDefinitionId^ get ();
}
static member PartPhaseParametersConflictWithOriginal : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace